Revit 2027 API
ParameterTypeId.WallBaseConstraint Property
 "Base Constraint"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId WallBaseConstraint { get; }
Public Shared ReadOnly Property WallBaseConstraint As ForgeTypeId
	Get
public:
static property ForgeTypeId^ WallBaseConstraint {
	ForgeTypeId^ get ();
}
static member WallBaseConstraint : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace